-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: study
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `category_tb`
--

DROP TABLE IF EXISTS `category_tb`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `category_tb` (
  `category_id` int NOT NULL AUTO_INCREMENT,
  `category_name` varchar(45) NOT NULL,
  PRIMARY KEY (`category_id`),
  UNIQUE KEY `category_name_UNIQUE` (`category_name`)
) ENGINE=InnoDB AUTO_INCREMENT=512 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `category_tb`
--

LOCK TABLES `category_tb` WRITE;
/*!40000 ALTER TABLE `category_tb` DISABLE KEYS */;
INSERT INTO `category_tb` VALUES (66,'OS/Networking/보안/모바일'),(233,'SF/공상과학소설'),(123,'각국경제사/전망'),(156,'각국정치'),(148,'개신교'),(271,'건강'),(10,'건강/다이어트/미용'),(249,'건강/생활'),(115,'건강에세이/건강법'),(54,'건축/인테리어'),(102,'게임'),(104,'결혼'),(4,'결혼/가정'),(11,'경영'),(120,'경영관리'),(119,'경영이론/전략'),(118,'경영일반'),(257,'경영전략/경영관리'),(12,'경제'),(204,'경제/시사'),(122,'경제일반/경제상식'),(219,'공부방법/진학'),(234,'공포/추리/미스터리소설'),(174,'과학사'),(173,'과학이론/철학'),(35,'과학일반/교양과학'),(88,'교양/학습'),(188,'교양음악'),(140,'교양철학'),(162,'교육이론/교육사'),(244,'교육일반'),(232,'교훈/지혜/상식'),(184,'구기'),(51,'국내여행'),(185,'국내여행일반'),(202,'국내창작그림책'),(27,'국방/군사/경찰'),(206,'국어/글쓰기/논술'),(270,'그녀, 책을 읽다'),(67,'그래픽/멀티미디어'),(81,'그림책'),(139,'글쓰기'),(44,'기계/기계공학'),(20,'기독교'),(101,'기술공학일반'),(143,'기타'),(96,'기타수험서/자격증'),(77,'기타외국어'),(18,'기타인문학'),(22,'기타종교'),(223,'논술/면접/수시'),(82,'놀이학습'),(43,'농수산/축산'),(182,'농업'),(191,'대중음악'),(197,'데이터베이스론'),(15,'독서/창작'),(138,'독서/책읽기'),(75,'독일어'),(177,'동물학/곤충학'),(32,'동양사/동양문화'),(141,'동양철학'),(86,'동요/동시'),(265,'드라마 세계명작'),(264,'드라마 전래동화'),(50,'레저/스포츠'),(124,'마케팅/세일즈'),(97,'만화'),(268,'명상/다이어트'),(55,'무용'),(172,'문명/문명사'),(133,'문서/정보/시간관리'),(238,'문인/작가론'),(237,'문학비평/평론'),(235,'문학이론일반'),(164,'문화사'),(39,'물리'),(179,'물리이야기'),(263,'뮤지컬 동화'),(58,'미술'),(193,'미술일반'),(116,'미용/다이어트'),(117,'민간요법/대체의학'),(26,'법학'),(240,'법학일반'),(103,'부부'),(21,'불교'),(245,'불교경전'),(149,'불교의이해'),(100,'비즈니스/경제'),(129,'비즈니스능력계발'),(134,'사고법/두뇌계발'),(60,'사진/영상'),(261,'사회'),(152,'사회문제/사회복지'),(151,'사회문화'),(153,'사회운동/NGO'),(23,'사회학'),(243,'사회학이론/사상'),(150,'사회학일반'),(8,'살림/주거환경'),(36,'생물학/생명과학'),(160,'생활법률'),(114,'생활요리'),(31,'서양사/서양문화'),(142,'서양철학'),(259,'성공/처세'),(30,'세계사/세계문화'),(213,'세계전래/명작동화'),(90,'소설'),(40,'수학'),(221,'수학/과학'),(180,'수학이야기'),(2,'수험서/자격증'),(251,'수험영어'),(3,'스마트동화'),(91,'시'),(253,'시/에세이/기행'),(176,'식물학'),(34,'신화/전설'),(170,'신화의이해'),(144,'심리치료'),(17,'심리학'),(145,'심리학이해'),(187,'아시아여행'),(267,'알파파오르골'),(80,'어린이(초등)'),(207,'어린이교양/기타'),(87,'어린이만화'),(211,'어린이영어'),(83,'어린이학습'),(78,'어학사전'),(25,'언론/미디어'),(158,'언론학/미디어론'),(147,'언어학/기호학'),(92,'에세이'),(210,'여행/지리'),(262,'역사'),(203,'역사/문화/인물/신화'),(28,'역사일반'),(146,'역학/사주/풍수지리'),(192,'연극/영화이론/비평'),(71,'영어'),(110,'영어교육'),(252,'영어로읽는명작'),(199,'영어문법/작문'),(198,'영어회화/비즈니스'),(250,'영어회화/청취'),(57,'영화/연극'),(1,'예술/대중문화'),(224,'예술/문화'),(196,'예술심리/시각'),(59,'예술의이해'),(195,'예술이야기'),(209,'예체능'),(254,'오디오드라마'),(190,'오페라/뮤지컬/기타극음악'),(68,'오피스활용'),(157,'외교/국제관계'),(227,'외국 소설'),(230,'외국 에세이'),(84,'외국동화'),(247,'외국어'),(215,'외국창작동화'),(9,'요리'),(113,'요리일반'),(178,'우주천문학'),(186,'유럽여행'),(79,'유아'),(6,'육아'),(108,'육아법/육아일기'),(107,'육아일반'),(135,'은퇴/노후준비'),(56,'음악'),(189,'음악이론/비평'),(42,'의학/간호학'),(181,'의학일반/이론'),(130,'인간관계/심리'),(171,'인류학'),(260,'인문'),(248,'인문/사회/역사'),(14,'인문교양'),(137,'인문교양/상식'),(136,'인문일반'),(214,'인물/위인'),(231,'인물/자전적 에세이'),(169,'인물사'),(175,'인체'),(112,'인테리어'),(167,'일본사/일본문화'),(72,'일본어'),(106,'임신/출산'),(5,'임신/출산/태교'),(99,'자기계발'),(13,'자기관리'),(128,'자기능력계발'),(7,'자녀교육'),(109,'자녀교육 일반'),(47,'자동차/항공/선박/철도'),(205,'자연/과학'),(266,'자연의소리'),(98,'잡지'),(93,'장르소설'),(121,'재무/회계'),(126,'재테크/금융'),(258,'재테크/무역'),(273,'저자 인터뷰'),(46,'전기/전자공학'),(163,'전쟁'),(222,'정치/사회/경제'),(24,'정치/사회/법'),(246,'정치가'),(155,'정치이론/사상/사상사'),(154,'정치일반'),(212,'종교/철학'),(19,'종교일반'),(111,'좋은 부모 되기'),(272,'좋은생각'),(73,'중국어'),(168,'중동/인도/이슬람/기타'),(37,'지구과학'),(33,'지리학'),(132,'진로/이민/연수'),(125,'창업/취업/유통'),(236,'창작/문장작법'),(127,'처세/성공'),(38,'천문학'),(16,'철학'),(220,'청소년교양일반'),(89,'청소년문학'),(225,'청소년역사/신화'),(239,'청소년자기계발'),(200,'초등1~2학년'),(201,'초등5~6학년'),(159,'출판'),(49,'취미생활'),(183,'취미일반'),(94,'취업/상식/적성검사'),(269,'치유 음악'),(62,'컴퓨터/IT 일반'),(63,'컴퓨터공학'),(95,'컴퓨터관련/OA자격증'),(64,'컴퓨터입문/활용'),(53,'테마여행'),(45,'토목/건축공학'),(256,'투자/재테크'),(61,'패션'),(74,'프랑스어'),(69,'프로그래밍/언어'),(70,'프로그래밍개발/방법론'),(226,'한국 소설'),(229,'한국 에세이'),(228,'한국 현대시'),(217,'한국고전/전래동화'),(166,'한국근대/현대사'),(218,'한국동요/동시'),(85,'한국동화'),(255,'한국문학100선'),(29,'한국사/한국문화'),(165,'한국사이해'),(241,'한국어'),(216,'한국창작동화'),(242,'한국철학'),(76,'한문/한국어'),(208,'한자/고사성어/속담'),(52,'해외여행'),(105,'행복한 가정'),(161,'헌법'),(65,'홈페이지/웹'),(131,'화술/협상/회의'),(41,'화학'),(48,'환경/도시/조경/소방'),(194,'회화/그래픽디자인/만화');
/*!40000 ALTER TABLE `category_tb` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-01-09 16:47:04
